#include "dac8552.h"

//-----------------------------------------------------------------
// void DACDAC8552_delay(uint16_t length)
//-----------------------------------------------------------------
// 简单延时函数
//-----------------------------------------------------------------
void DAC8552_delay(uint16_t length)
{
    length = length * 36;
    while(length--);
}

//-----------------------------------------------------------------
// void DACDAC8552_GPIO_Init(void)
//-----------------------------------------------------------------
// 初始化DACDAC8552的GPIO
//-----------------------------------------------------------------
void DAC8552_GPIO_Init(void)
{

    DAC8552_SYNC_H;
    DAC8552_SCLK_H;
    DAC8552_DATA_L;
    DAC8552_Write_Reg(0x000000|32768);
	DAC8552_Write_Reg(0x340000|32768);
}

//-----------------------------------------------------------------
// void DACDAC8552_Write_Reg(uint32_t DAC8552_DATA)
//-----------------------------------------------------------------
// 写入24位数据到DACDAC8552
//-----------------------------------------------------------------
void DAC8552_Write_Reg(uint32_t DAC8552_DATA)
{
    uint8_t i;
    
    DAC8552_SYNC_L;
    DAC8552_delay(1);
    
    // 发送24位数据，MSB first
    for(i = 0; i < 24; i++)
    {
        DAC8552_SCLK_L;
        DAC8552_delay(1);
        
        if(DAC8552_DATA & 0x800000)
            DAC8552_DATA_H;
        else
            DAC8552_DATA_L;
            
        DAC8552_delay(1);
        DAC8552_SCLK_H;
        DAC8552_delay(1);
        
        DAC8552_DATA <<= 1;
    }
    
    DAC8552_SCLK_L;
    DAC8552_SYNC_H;
    DAC8552_delay(1);
}

//-----------------------------------------------------------------
// void DACDAC8552_Write_CHA(uint16_t DAC8552_DATA)
//-----------------------------------------------------------------
// 写入数据到通道A并更新输出
//-----------------------------------------------------------------
void DAC8552_Write_CHA(uint16_t DAC8552_DATA)
{
    // uint32_t command = DAC8552_WRITE_CHA;
    // command <<= 16;
    // command |= (DAC8552_DATA & 0xFFFF);
    
    // DAC8552_Write_Reg(command);
      DAC8552_Write_Reg(0x100000|DAC8552_DATA);
}

//-----------------------------------------------------------------
// void DACDAC8552_Write_CHB(uint16_t DAC8552_DATA)
//-----------------------------------------------------------------
// 写入数据到通道B并更新输出
//-----------------------------------------------------------------
void DAC8552_Write_CHB(uint16_t DAC8552_DATA)
{
    // uint32_t command = DAC8552_WRITE_CHB;
    // command <<= 16;
    // command |= (DAC8552_DATA & 0xFFFF);
    
    // DAC8552_Write_Reg(command);

    	DAC8552_Write_Reg(0x240000|DAC8552_DATA);
}

